In [7]:
#Data manipulation with pandas

import pandas as pd
olympic_Data_list = {'hostcity':['london', 'beijing', 'atlanta', 'athens', 'sydney'], 'year': [2011, 2012, 2013, 2014,2015], 'paticipants': [200,201,202,203,204]}
df = pd.DataFrame(olympic_Data_list)
df.hostcity
df.describe

<bound method NDFrame.describe of   hostcity  year  paticipants
0   london  2011          200
1  beijing  2012          201
2  atlanta  2013          202
3   athens  2014          203
4   sydney  2015          204>

In [3]:
#dataframe from dicts

olympic_data_dict = {'london':{2012:205}, 'beijing':{2013:400}}
df1 = pd.DataFrame(olympic_data_dict)
df1

      london  beijing
2012   205.0      NaN
2013     NaN    400.0

In [8]:
#dataframe from dict of series

olympic_series_participation = pd.Series([205,204,203,202,201], index=[2012,2013,2014,2015,2016])
olympic_series_country = pd.Series(['london', 'beijing', 'athens', 'atlanta', 'sydeny'], index=[2012,2013,2014,2015,2016])

df_olympic_series = pd.DataFrame({'no of participating countries':olympic_series_participation,'host cities': olympic_series_country})
df_olympic_series

      no of participating countries host cities
2012                            205      london
2013                            204     beijing
2014                            203      athens
2015                            202     atlanta
2016                            201      sydeny

In [9]:
#dataframe from ndarray

import numpy as np
np_array = np.array([2012,2013,2014,2015,2016])
dict_ndarray = {'year':np_array}
df_ndarray = pd.DataFrame(dict_ndarray)
df_ndarray

   year
0  2012
1  2013
2  2014
3  2015
4  2016

In [11]:
#dataframe from dataframe

df_from_df = pd.DataFrame(df_olympic_series)
df_from_df

      no of participating countries host cities
2012                            205      london
2013                            204     beijing
2014                            203      athens
2015                            202     atlanta
2016                            201      sydeny

In [3]:
#veiw and select data demo 

import numpy as np 
import pandas as pd
olympic_series_participation = pd.Series([205,204,203,202,201], index=[2012,2013,2014,2015,2016])
olympic_series_country = pd.Series(['london', 'beijing', 'athens', 'atlanta', 'sydeny'], index=[2012,2013,2014,2015,2016])

df_olympic_series = pd.DataFrame({'no of participating countries':olympic_series_participation,'host cities': olympic_series_country})

#display content
df_olympic_series

      no of participating countries host cities
2012                            205      london
2013                            204     beijing
2014                            203      athens
2015                            202     atlanta
2016                            201      sydeny

In [4]:
#view datafram describe

df_olympic_series.describe

<bound method NDFrame.describe of       no of participating countries host cities
2012                            205      london
2013                            204     beijing
2014                            203      athens
2015                            202     atlanta
2016                            201      sydeny>

In [5]:
#view top 2 records
df_olympic_series.head(2)

      no of participating countries host cities
2012                            205      london
2013                            204     beijing

In [6]:
#view last 3 records
df_olympic_series.head(3)

      no of participating countries host cities
2012                            205      london
2013                            204     beijing
2014                            203      athens

In [7]:
#view index of dataset
df_olympic_series.index

Int64Index([2012, 2013, 2014, 2015, 2016], dtype='int64')

In [8]:
#view columns

df_olympic_series.columns

Index(['no of participating countries', 'host cities'], dtype='object')

In [9]:
#select data for host cities 

df_olympic_series['host cities']

2012     london
2013    beijing
2014     athens
2015    atlanta
2016     sydeny
Name: host cities, dtype: object

In [10]:
#no of participating countries
df_olympic_series['no of participating countries']

2012    205
2013    204
2014    203
2015    202
2016    201
Name: no of participating countries, dtype: int64

In [11]:
#select label location by access from label 
df_olympic_series.loc[2012]

no of participating countries       205
host cities                      london
Name: 2012, dtype: object

In [12]:
#select label using iloc based indexing by position

df_olympic_series.iloc[0:2]

      no of participating countries host cities
2012                            205      london
2013                            204     beijing

In [15]:
#integer location based selection based on index values
df_olympic_series.iat[1,1]

'beijing'

In [17]:
#condition to select data element where number of participants are gretaer than 200

df_olympic_series[df_olympic_series['no of participating countries']>200]

      no of participating countries host cities
2012                            205      london
2013                            204     beijing
2014                            203      athens
2015                            202     atlanta
2016                            201      sydeny

In [19]:
#missing values

import pandas as pd
first_series = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
second_series = pd.Series([10,202,30,40,50], index=['c','e','f','g','h'])
sum_series = first_series+second_series
sum_series

a      NaN
b      NaN
c     13.0
d      NaN
e    207.0
f      NaN
g      NaN
h      NaN
dtype: float64

In [23]:
#drop NaN numbers
dropna_s = sum_series.dropna()
dropna_s

c     13.0
e    207.0
dtype: float64

In [24]:
dropna_s.fillna(0)
dropna_s

c     13.0
e    207.0
dtype: float64

In [25]:
fillna_s = sum_series.fillna(0)
fillna_s

a      0.0
b      0.0
c     13.0
d      0.0
e    207.0
f      0.0
g      0.0
h      0.0
dtype: float64

In [31]:
# filling NaN values before adding 

fill_before_add = first_series.add(second_series,fill_value=0)
fill_before_add

a      1.0
b      2.0
c     13.0
d      4.0
e    207.0
f     30.0
g     40.0
h     50.0
dtype: float64